html/20231209T093750--freshsetup__emacs.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://arvydasg.github.io/devnotes/html/rss.xml"
      title="RSS feed for https://arvydasg.github.io/devnotes/html">
<title>freshsetup</title>
<meta name="author" content="Arvydas Gasparavicius">
<meta name="referrer" content="no-referrer">
<meta name="viewport" content="initial-scale=1,width=device-width,minimum-scale=1">
<link rel="stylesheet" href="../static/style.css"/>
<link rel="icon" href="../static/ag.ico">
</head>
<body>
<div id="preamble" class="status"><br>preamble here yo</br></div>
<div id="content">
<div class="post-date">15 Dec 2023</div><h1 class="post-title"><a href="https://arvydasg.github.io/devnotes/html/20231209T093750--freshsetup__emacs.html">freshsetup</a></h1>
<p>
After creating a new <a href="20231209T080431--moving-emacsd-into-dotfiles-repo__emacs.html">dotfiles repo</a> - I realized there is a need to set up
everything automatically on the new machine IF the user so desires.
</p>

<p>
For that I have created a script called "freshsetup.sh" in dotfiles directory.
When it is launched, it does everything I need. TODO write a bit about
freshsetup ir ar jis vapse needed, since using nix now.
</p>

<p>
Everyting regarding <code>freshsetup</code> topic(tag):
</p>

<ul class="org-ul">
<li><a href="20231126T012052--make-denote-faster-on-wsl__emacs_rsync_scripting_wsl.html">Make denote faster on wsl</a></li>
<li><a href="20231130T065309--fetch-and-pull-changes-automatically__git_wsl.html">fetch and pull automatically</a></li>
<li><a href="20231209T200922--wsl-clock-is-out-of-sync-with-windows__windows_wsl.html">wsl clock is out of sync</a></li>
</ul>

<p>
All of the steps above are described for when using an Ubuntu distro on wsl on
windows. But If I am using nixos&#x2026; stuff will change. :) More on that later.
</p>
<div class="taglist"><a href="https://arvydasg.github.io/devnotes/html/tags.html">Tags</a>: <a href="https://arvydasg.github.io/devnotes/html/tag-emacs.html">emacs</a> </div></div>
<div id="postamble" class="status"><br>postamble in he house</br></div>
</body>
</html>
